examples/soap/Swf Suites4SociaalDomein/dump/04-request-genereerDocumentIdentificatie_Di02.xml

<SOAP-ENV:Envelope xsi:schemaLocation="http://www.egem.nl/StUF/sector/zkn/0310 zkn0310-p28\zs-dms\zkn0310_msg_zs-dms_resolved.xsd" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ZKN:genereerDocumentIdentificatie_Di02>
         <ZKN:stuurgegevens>
            <StUF:berichtcode>Di02</StUF:berichtcode>
            <StUF:zender>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>GWS4all</StUF:applicatie>
               <StUF:gebruiker>Gebruiker</StUF:gebruiker>
            </StUF:zender>
            <StUF:ontvanger>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>CDR</StUF:applicatie>
            </StUF:ontvanger>
            <StUF:referentienummer>34ac4b6e-c2c6-4964-9e66-81bdf4e652e8</StUF:referentienummer>
            <StUF:tijdstipBericht>20200507075603668</StUF:tijdstipBericht>
            <StUF:functie>genereerDocumentidentificatie</StUF:functie>
         </ZKN:stuurgegevens>
      </ZKN:genereerDocumentIdentificatie_Di02>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>