src/main/java/nl/haarlem/translations/zdstozgw/converter/impl/GenereerZaakIdentificatie_Du02.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body>
		<ZKN:genereerZaakIdentificatie_Du02 xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<ZKN:stuurgegevens>
				<StUF:berichtcode>Du02</StUF:berichtcode>
				<StUF:zender>
					<StUF:organisatie>${zenderOrganisatie}</StUF:organisatie>
					<StUF:applicatie>${zenderApplicatie}</StUF:applicatie>
					<StUF:gebruiker>${zenderGebruiker}</StUF:gebruiker>
				</StUF:zender>
				<StUF:ontvanger>
					<StUF:organisatie>${ontvangerOrganisatie}</StUF:organisatie>
					<StUF:applicatie>${ontvangerApplicatie}</StUF:applicatie>
					<StUF:gebruiker>${ontvangerGebruiker}</StUF:gebruiker>
				</StUF:ontvanger>
				<StUF:referentienummer>${referentienummer}</StUF:referentienummer>
				<StUF:tijdstipBericht>${tijdstipbericht}</StUF:tijdstipBericht>
				<StUF:functie>genereerZaakidentificatie</StUF:functie>
			</ZKN:stuurgegevens>
			<ZKN:document StUF:entiteittype="ZAK" StUF:functie="entiteit">
				<ZKN:identificatie>${zaakidentificatie}</ZKN:identificatie>
			</ZKN:document>
		</ZKN:genereerZaakIdentificatie_Du02>
	</s:Body>
</s:Envelope>